package no.bugs.homework2.loop;

import java.util.Scanner;

public class Loop {
    /**
     * Задача 1: Вывод чисел от 1 до 10
     * Напишите программу, которая выводит все числа от 1 до 10.
     */
    public static void main(String[] args) {

        for (int i = 1; i < 11; i++)
            System.out.print(i + " ");


    }


}
